org/concepts/magic:-the-gathering.org
#+setupfile:./hugo_setup.org
#+hugo_slug: mtg
#+TITLE: Magic The Gathering

i've been playing magic the gathering on and off for about ten years. my
relationship with the game has changed over the years, of course -- starting
as something that resembles a board game, my understanding of the game
adapted and i became a collector, then a competitor, then a collector again.
now, i primarily hold onto my cards as a memory of a game i once had more
time to enjoy, hoping that i will make the time to play it again.

* Engines
https://github.com/magefree/mage

XMage
(Informally) Cockatrice


https://github.com/stassa/Gleemin/blob/master/README the mtg project i was
thinking about
https://github.com/pitr/icfp2011 fun lambda the gathering language

https://github.com/brokenthumbs/_boostertutor/blob/master/scryfall.py
https://www.reddit.com/r/madeinhaskell/comments/hzuk08/magic_the_gathering_in_your_terminal/ play mtg in your terminal written in haskell! seems like a fun project to help out with.
