content/posts/magic:-the-gathering.md
+++
title = "Magic The Gathering"
author = ["Jacob Chvatal"]
lastmod = 2020-08-02T22:06:48-07:00
slug = "mtg"
draft = false
+++

i've been playing magic the gathering on and off for about ten years. my
relationship with the game has changed over the years, of course -- starting
as something that resembles a board game, my understanding of the game
adapted and i became a collector, then a competitor, then a collector again.
now, i primarily hold onto my cards as a memory of a game i once had more
time to enjoy, hoping that i will make the time to play it again.


## Engines {#engines}

<https://github.com/magefree/mage>

XMage
(Informally) Cockatrice

<https://github.com/stassa/Gleemin/blob/master/README> the mtg project i was
thinking about
<https://github.com/pitr/icfp2011> fun lambda the gathering language

<https://github.com/brokenthumbs/%5Fboostertutor/blob/master/scryfall.py>
<https://www.reddit.com/r/madeinhaskell/comments/hzuk08/magic%5Fthe%5Fgathering%5Fin%5Fyour%5Fterminal/> play mtg in your terminal written in haskell! seems like a fun project to help out with.
